{
  "entryPointNodeId": "properNoun_replacer1",
  "nodeDefinitions": [
    {
      "id": "properNoun_replacer1",
      "displayName": "0. Proper Noun Replacer (Initial)",
      "type": "llm_agent",
      "stateInputArgs": {
        "headline": "input_headline"
      },
      "stateOutputKey": "properNoun_replacement1_result",
      "derivedStateOutputs": {
        "headline_with_placeholders": {
          "path": "text_with_placeholders",
          "fallbackKey": "input_headline"
        },
        "properNoun_map": {
          "path": "properNoun_map",
          "fallbackValue": {}
        }
      },
      "promptConfig": {
        "systemMessage": "You are an AI assistant. Your task is to replace proper nouns in the given text with unique, bracketed, uppercase placeholders (e.g., [PERSON_A], [THING_B], [LOCATION_C]). Identify the original proper nouns and the placeholders you created. Output ONLY valid JSON as specified, without any markdown or other text outside the JSON structure.",
        "developerInstructionsTemplate": "Instruction:\n1. Analyze the input text: \"{{headline}}\".\n2. Identify all proper nouns.\n3. For each identified proper noun, create a unique placeholder (e.g., [PERSON_A], [PERSON_B], [OBJECT_A], [GROUP_A]).\n4. Replace the proper nouns in the text with these placeholders.\n5. Provide a mapping of each placeholder to its original proper noun.\nYour entire output MUST be a single, valid JSON object.\n\nRequired JSON Output Schema:\n{\n  \"original_text\": \"The original input text, which is '{{headline}}'\",\n  \"text_with_placeholders\": \"The text with properNouns replaced by placeholders\",\n  \"properNoun_map\": {\n    \"[PLACEHOLDER_A]\": \"original_properNoun_A\",\n    \"[PLACEHOLDER_B]\": \"original_properNoun_B\"\n  }\n}\n\nExample:\nInput Text: \"Satya Nadella visited London.\"\nOutput:\n{\n  \"original_text\": \"Satya Nadella visited London.\",\n  \"text_with_placeholders\": \"[PERSON_A] visited [LOCATION_A].\",\n  \"properNoun_map\": {\n    \"[PERSON_A]\": \"Satya Nadella\",\n    \"[LOCATION_A]\": \"London\"\n  }\n}",
        "userInputTemplate": "Process this text: \"{{headline}}\""
      }
    },
    {
      "id": "parallel_analyzers_coordinator",
      "displayName": "1. Parallel Analyzers",
      "type": "parallel_llm_group_coordinator",
      "stateInputArgs": {
        "headline_with_placeholders": "headline_with_placeholders",
        "input_headline": "input_headline"
      },
      "analyzerTasks": [
        {
          "id": "cognitive_frames_analyzer",
          "displayName": "1a. Generic Emphasis Framing",
          "stateOutputKey": "cognitive_frames_analysis_result",
          "promptConfig": {
            "systemMessage": "You are an expert in Journalism and Media Framing. Media framing refers to the deliberate presentation of information in order to elicit a desired response or shift in reader’s attitude. \nMedia Frames are communicative devices that shape and alter audience members’ interpretations and preferences. They are **“emphasis structures”** within journalistic content that highlight specific aspects of reality while backgrounding others.\n\nYour job is take in a news headline as input  (which may contain placeholders like [PERSON_A]), carefully analyze it, and rewrite the headline by emphasizing an opposing media frame. In other words, your job is to \"flip\" the Media Framing of a news headline. Output ONLY valid JSON as specified.",
            "developerInstructionsTemplate": "Instructions:\n1. Analyze the input headline. Carefully parse the input headline into agent/patient roles, hero/villain/victim roles, keywords, linguistic indicators, and contextual elements of the input headline. Then, Identify relevant types of generic media framing (e.g., attribution of responsibility, conflict, human interest, economic consequences, and morality, progress/recovery. Finally, Speculate the intention behind the frame identified, and the effect it can have on the audience.\n2. Based on your analysis, rewrite the headline to emphasize an opposing media frame while preserving the core facts from the original headline. In other words, you will \"flip\" the media framing of the news headline. Retain the placeholders in the input headline                                                     \n3. Formatting Instructions: Your entire output MUST be a single, valid flat JSON object, only consisting of keys \"input_headline\", \"analysis\", and \"rewritten_headline\", without any nested keys. In both \"input_headline\" and  \"rewritten_headline\" highlight the most important word changed by surrounding it with two + signs like this: ++WORD++. If you have added any extra information in the \"rewritten_headline\", which is not there in the \"input_headline\", please strictly surround the information in two - signs like this: --EXTRA INFO--.\n\nExample 1:\nInput: \"[COMPANY_A] announces record profits amidst layoffs, citing efficiency ++gains++.\"\nOutput:\n{\n  \"input_headline\": \"[COMPANY_A] announces record profits amidst layoffs, citing efficiency ++gains++.\",\n  \"analysis\": \"The input headline frames [COMPANY_A]'s actions positively, emphasizing 'efficiency gains' and 'record profits'. This suggests an **economic consequences** frame, where the company is presented as a successful entity making necessary, albeit difficult, business decisions for financial improvement. The company is the 'hero' (successful, efficient), and the layoffs are framed as a neutral consequence of this efficiency. The intention is likely to legitimize the layoffs and maintain a positive corporate image, potentially leading the audience to view the layoffs as a necessary evil for overall economic health. The 'amidst layoffs' part is present but downplayed by the positive spin on profits and efficiency.\",\n  \"rewritten_headline\": \"Amidst record profits, [COMPANY_A]'s layoffs spark --growing-- concerns over ++corporate greed++ and worker well-being.\"\n}\nExample 2:\nInput: \"[LOCATION_A] Begins Recovery as Floodwaters Recede, Aid Pours In\"\nOutput:\n{\n  \"input_headline\": \"[LOCATION_A] Begins Recovery as Floodwaters Recede, Aid Pours In\",\n  \"analysis\": \"This headline uses a progress/recovery frame.  The keywords \\\\\\\"Begins Recovery\\\\\\\" and \\\\\\\"Aid Pours In\\\\\\\" emphasize a positive narrative of progress following a disaster. [LOCATION_A] is implicitly framed as the victim, but the focus is on the positive aspects of the situation, such as the receding floodwaters and the influx of aid. This frame aims to inspire hope and optimism, potentially downplaying the extent of the damage and the ongoing challenges faced by residents. The intention is to offer reassurance and possibly encourage continued aid efforts. The effect on the audience is likely to be one of relief and encouragement.\",\n  \"rewritten_headline\": \"[LOCATION_A] ++Struggles++ with Aftermath of Devastating Floods Despite Incoming Aid\"\n}\nExample 3:\nInput: \"[PROFESSION_A] [PERSON_A] Maintains Innocence Amidst ++EVENT_A++\"\nOutput:\n{\n  \"input_headline\": \"[PROFESSION_A] [PERSON_A] Maintains Innocence Amidst ++EVENT_A++\",\n  \"analysis\": \"This headline uses a framing device that centers on [PERSON_A]'s claim of innocence.  This is a classic framing of a legal or ethical controversy, focusing on the individual's perspective and their assertion of innocence. The keywords \\\\\\\"Maintains Innocence\\\\\\\" strongly suggest a morality frame, where the audience is implicitly asked to consider the ethical implications of the situation.  The placement of ++EVENT_A++ as a secondary element downplays the nature of the event itself and focuses attention on [PERSON_A]'s response. The intention is to generate sympathy for [PERSON_A] and potentially cast doubt on the legitimacy of accusations against them.  The effect on the audience might be to create a presumption of innocence until proven guilty, or at least to foster uncertainty about [PERSON_A]'s guilt.\",\n  \"rewritten_headline\": \"[EVENT_A] Casts ++Doubt++ on [PROFESSION_A] [PERSON_A]'s Claims of Innocence\"\n}",
            "userInputTemplate": "Input: \"{{headlineToAnalyze}}\""
          }
        },
        {
          "id": "speculative_reframing_analyzer",
          "displayName": "1b. Speculative Reframing",
          "stateOutputKey": "speculative_reframing_result",
          "promptConfig": {
            "systemMessage": "You are an expert in Journalism and Media Framing. Media framing refers to the deliberate presentation of information in order to elicit a desired response or shift in reader’s attitude. \nMedia Frames are communicative devices that shape and alter audience members’ interpretations and preferences.\n\nYour job is take in a news headline as input  (which may contain placeholders like [PERSON_A]), carefully analyze it, and rewrite the news headlines with additional plausible, but unlikely, speculative information, inspired by Russell's Teapot or \"overfitting\" in machine learning. Write clearly and plausibly.  Output ONLY a valid  FLAT JSON as specified.",
            "developerInstructionsTemplate": "Instructions:\n1. Analyze the input headline. Carefully parse the input headline into agent/patient roles, hero/villain/victim roles, keywords, linguistic indicators, and contextual elements of the input headline. Decide randomly on adding speculative information to one of the roles.\n2. Paraphrase and rewrite the headline by adding the extra speculative information to the original headline. DO NOT use common tropes like aliens, conspiracy, top-secret programs. Instead the speculative information should be realistic, physically plausible, but just unlikely. It can be either of the following - dodgy, serious, devastating, blimey, clickbait, tell me the odds type situation. Retain the placeholders in the input headline.\n3. Formatting Instructions: Your entire output MUST be a single, valid flat JSON object, only consisting of keys \"input_headline\", \"analysis\", and \"rewritten_headline\", without any nested keys. Any speculative extra information added in the \"rewritten_headline\", which is not there in the \"input_headline\", should be strictly surrounded by two - characters like this: --SPECULATIVE EXTRA INFO--.\n\nExample 1:\nInput: \"Stray dog kills 4-year-old in [LOCATION_A]\"\nOutput:\n{\n  \"input_headline\": \"Stray dog kills 4-year-old in [LOCATION_A]\",\n  \"analysis\": \"The input headline clearly identifies a 'stray dog' as the agent/villain and a '4-year-old' as the patient/victim. The action is 'kills', and the location is '[LOCATION_A]'. The headline is stark and tragic. To add speculative, but unlikely information, I will focus on the 'stray dog' and introduce a plausible, yet surprising, detail about its past.\",\n  \"rewritten_headline\": \"Stray dog --formerly a pampered show dog abandoned after a career-ending injury-- kills 4-year-old in [LOCATION_A]\"\n}\nExample 2:\nInput: \"[COUNTRY_A] [TITLE_A] Says Will Respect [EVENT_A] If [COUNTRY_B] Does\"\nOutput:\n{\n  \"input_headline\": \"[COUNTRY_A] [TITLE_A] Says Will Respect [EVENT_A] If [COUNTRY_B] Does\",\n  \"analysis\": \"The input headline presents a conditional statement regarding international relations.  [COUNTRY_A] is the agent, taking a conditional stance. [COUNTRY_B] is the other party involved. The [EVENT_A] is the object of the conditional respect. To add speculative information, I will focus on the [TITLE_A] and add a detail about their personal history that might influence their decision, making it more nuanced and less predictable.\",\n  \"rewritten_headline\": \"[COUNTRY_A] [TITLE_A], --whose great-grandmother was a renowned peace activist in [COUNTRY_B] during the [HISTORICAL_EVENT]--, Says Will Respect [EVENT_A] If [COUNTRY_B] Does\"\n}",
            "userInputTemplate": "Input: \"{{headlineToAnalyze}}\""
          }
        },
        {
          "id": "euphemism_analyzer",
          "displayName": "1c. Euphemism Analysis & Literal Flip",
          "stateOutputKey": "euphemism_analysis_result",
          "promptConfig": {
            "systemMessage": "You are an expert in Journalism and Media Framing. Media framing refers to the deliberate presentation of information in order to elicit a desired response or shift in reader’s attitude. \nMedia Frames are communicative devices that shape and alter audience members’ interpretations and preferences. They are **“emphasis structures”** within journalistic content that highlight specific aspects of reality while backgrounding others.\n\nYour job is take in a news headline as input  (which may contain placeholders like [PERSON_A]), carefully analyze it, and rewrite the headline by emphasizing an opposing media frame. In other words, your job is to \"flip\" the Media Framing of a news headline. Output ONLY valid JSON as specified.",
            "developerInstructionsTemplate": "Instructions:\n1. Analyze the input headline. Carefully parse the input headline into agent/patient roles, hero/villain/victim roles, keywords, linguistic indicators, and contextual elements of the input headline. Then, detect euphemistic, diplomatic terms or phrases, which downplay, white wash or use Colonial Administrative Language in the headline . Speculate the media framing effects of such using phrases on the audience.\n2. Based on your analysis, rewrite the headline by replacing identified euphemistic, diplomatic, or Colonial Administrative terms  with their direct, literal, crude, raw meanings. Retain the placeholders in the input headline.                                                 \n3. Formatting Instructions: Your entire output MUST be a single, valid flat JSON object, only consisting of keys \"input_headline\", \"analysis\", and \"rewritten_headline\", without any nested sturcture in. In both \"input_headline\" and  \"rewritten_headline\" highlight the most important word changed (euphemistic word replaced with crude raw word) by surrounding it with two + signs like this: ++WORD++. If you have added any extra information in the \"rewritten_headline\", which is not there in the \"input_headline\", please strictly surround the information in two - signs like this: --EXTRA INFO--.\n\nExample 1:\nInput: \"[MILITARY_UNIT] ++neutralized++ targets in [AREA_X] during a security operation.\"\nOutput:\n{\n  \"input_headline\": \"[MILITARY_UNIT] ++neutralized++ targets in [AREA_X] during a security operation.\",\n  \"analysis\": \"The input headline frames the military's actions in a positive, almost clinical light. 'Neutralized' is a euphemism for killing or destroying, suggesting a precise and justifiable action rather than a violent one. 'Targets' dehumanizes the individuals, making them seem like inanimate objects. 'Security operation' implies a necessary and protective measure, rather than an offensive or harmful act. These terms collectively downplay the violence and potential harm, aiming to elicit a sense of calm and justification from the audience. The framing serves to legitimize the military's actions and minimize any negative perceptions.\",\n  \"rewritten_headline\": \"[MILITARY_UNIT] ++slaughtered++ --people-- in [AREA_X] during a --violent-- operation.\"\n}\nExample 2:\nInput: \"Eyestalk ++ablation++, a common practice in the shrimp farming industry, is often used to induce maturation and spawning in female broodstock.\"\nOutput:\n{\n  \"input_headline\": \"Eyestalk ++ablation++, a common practice in the shrimp farming industry, is often used to induce maturation and spawning in female broodstock.\",\n  \"analysis\": \"The input headline presents 'eyestalk ablation' as a neutral, common practice in the shrimp farming industry. 'Ablation' is a clinical, euphemistic term for surgical removal, which downplays the invasive and potentially painful nature of the procedure for the shrimp. The phrase 'common practice' normalizes the action, suggesting it is an acceptable and routine part of the industry without implying any ethical concerns. 'Induce maturation and spawning' uses scientific-sounding language to describe the desired outcome, masking the forced and artificial nature of the process. The overall framing aims to inform about an industry practice without raising alarms or negative perceptions among the audience regarding animal welfare.\",\n  \"rewritten_headline\": \"Eyestalk ++mutilation++, a common practice in the shrimp farming industry, is often used to --force-- maturation and spawning in female broodstock.\"\n}",
            "userInputTemplate": "Input: \"{{headlineToAnalyze}}\""
          }
        },
        {
          "id": "episodic_thematic_analyzer",
          "displayName": "1d. episodic_thematic Analysis (Episodic/Thematic)",
          "stateOutputKey": "episodic_thematic_analysis_result",
          "promptConfig": {
            "systemMessage": "You are an expert in media framing analysis. Analyze news snippets to identify whether they use episodic or thematic framing and suggest a reframing that might include placeholders. Output ONLY valid JSON as specified.",
            "developerInstructionsTemplate": "Instruction:\n1. Carefully parse and analyze keywords, linguistic indicators, agent/patient roles, and contextual elements the input headline: \"{{headlineToAnalyze}}\".\n2. Determine if the headline uses thematic or episodic news framing to get a point accross.                                                \n3. If thematic framing is detected, convert it and rewrite the headline using episodic framing. If episodic framing is detected, convert it and rewrite the headline using thematic framing. Place any additional information added in parentheses. Retain the placeholders in the input headline.                                                                                                      \n4. Your entire output MUST be a single, valid JSON object.\n\nExample 1:\nInput: \"In [CITY_A], a 1-year-old boy died from complications of malnutrition.\"\nOutput:\n{\n  \"input_headline\": \"In [CITY_A], a 1-year-old boy died from complications of malnutrition.\",\n  \"analysis\": \"[Write analysis here]\",\n  \"rewritten_headline\": \"Widespread malnutrition, exacerbated by drought and aid shortages in places like [CITY_A], continues to claim young lives across the Horn of Africa, highlighting a systemic crisis.\"\n}",
            "userInputTemplate": "Input: \"{{headlineToAnalyze}}\""
          }
        },
        {
          "id": "violence_type_analyzer",
          "displayName": "1e. Violence Type Analysis & Systemic Link",
          "stateOutputKey": "violence_type_analysis_result",
          "promptConfig": {
            "systemMessage": "You are an expert in media news framing. Your job is analyze a headline contains spectacular violence (sudden, dramatic harm such as attacks, riots, murders). If spectacular violence IS found, you will speculate a plausible underlying systemic/structural cause and rewrite the headline appending this cause in parentheses. Output ONLY valid JSON as specified.",
            "developerInstructionsTemplate": "Instruction:\n1. Carefully parse and analyze keywords, linguistic indicators, agent/patient roles, and contextual elements the input headline: \"{{headlineToAnalyze}}\".\n2. Determine if the headlines contains spectacular violence (sudden, dramatic harm such as attacks, riots, murders).                       \n3. If spectacular violence is found, you will speculate a plausible underlying systemic/structural cause and rewrite the headline appending this cause in parentheses. If spectacular violence is not found: Indicate this clearly in the output. Retain the placeholders in the input headline.                                                                                                        \n4. Your entire output MUST be a single, valid JSON object.\n\nExample 1:\nInput: \"Rioters smash downtown storefronts in [CITY_B].\"\nOutput:\n{\n  \"input_headline\": \"Rioters smash downtown storefronts in [CITY_B].\",\n  \"analysis\": \"[Write analysis here]\",\n  \"rewritten_headline\": \"Rioters smash downtown storefronts in [CITY_B] (amid rising youth unemployment and a lack of community services).\"\n}",
            "userInputTemplate": "Input: \"{{headlineToAnalyze}}\""
          }
        }
      ]
    },
    {
      "id": "synthesizer",
      "displayName": "2. Synthesizer (Main Flip)",
      "type": "llm_agent",
      "stateInputArgs": {
        "headlineToSynthesize": "headlineToAnalyze",
        "analysis1": "cognitive_frames_analysis_result",
        "analysis2": "speculative_reframing_result",
        "analysis3": "euphemism_analysis_result",
        "analysis4": "episodic_thematic_analysis_result",
        "analysis5": "violence_type_analysis_result"
      },
      "stateOutputKey": "synthesis_result",
      "derivedStateOutputs": {
        "main_flipped_headline_with_placeholders": {
          "path": "flipped_headline",
          "fallbackValue": "Main alternative perspective unavailable (synthesis error or not found)"
        }
      },
      "promptConfig": {
        "systemMessage": "You are an expert in Journalism and Media Studies specializing in news framing. Your task is to generate a 'flipped_headline' that conveys the SAME CORE FACTS from the original headline but with an opposite (flipped) news framing, based on the provided analyses. Output ONLY valid JSON as specified.",
        "developerInstructionsTemplate": "Instruction:\n1. Study the original headline: \"{{headlineToSynthesize}}\".\n2. Review the provided analyses:\n   - 1a. Generic Emphasis Framing: {{analysis1}}\n   - 1b. Speculative Reframing: {{analysis2}}\n   - 1c. Euphemism Analysis & Literal Flip: {{analysis3}}\n   - 1d. episodic_thematic Analysis (Episodic/Thematic): {{analysis4}}\n   - 1e. Violence Type Analysis & Systemic Link: {{analysis5}}\n3. Based on these, choose one or more analyses that provide strong evidence of a particular news frame in the original headline.\n4. Generate a \"flipped_headline\" that reverses or significantly alters this news framing while ATTEMPTING TO PRESERVE THE CORE FACTUAL INFORMATION.\n5. The flipped headline should ideally use the same placeholders if they were present in \"{{headlineToSynthesize}}\".\nYour entire output MUST be a single, valid JSON object.\n\nRequired JSON Output Schema:\n{\n  \"input_headline_processed\": \"{{headlineToSynthesize}}\",\n  \"flipped_headline\": \"string (The new headline with flipped framing, may contain placeholders)\",\n  \"reasoning_for_flip\": \"string (Brief explanation of which analysis inspired the flip and how the frame was altered)\",\n  \"analysis_summary_used\": {\n      \"cognitive_frames_analyzer_had_error\": {{analysis1.error ? true : false}},\n      \"speculative_reframing_analyzer_had_error\": {{analysis2.error ? true : false}},\n      \"euphemism_analyzer_had_error\": {{analysis3.error ? true : false}},\n      \"episodic_thematic_analyzer_had_error\": {{analysis4.error ? true : false}},\n      \"violence_type_analyzer_had_error\": {{analysis5.error ? true : false}}\n  }},\n      \"speculative_reframing_analyzer_had_error\": {{analysis2.error ? true : false}},\n      \"euphemism_analyzer_had_error\": {{analysis3.error ? true : false}},\n      \"episodic_thematic_analyzer_had_error\": {{analysis4.error ? true : false}},\n      \"violence_type_analyzer_had_error\": {{analysis5.error ? true : false}}\n  }},\n      \"speculative_reframing_analyzer_had_error\": {{analysis2.error ? true : false}},\n      \"euphemism_analyzer_had_error\": {{analysis3.error ? true : false}},\n      \"episodic_thematic_analyzer_had_error\": {{analysis4.error ? true : false}},\n      \"violence_type_analyzer_had_error\": {{analysis5.error ? true : false}}\n  }},\n      \"speculative_reframing_analyzer_had_error\": {{analysis2.error ? true : false}},\n      \"euphemism_analyzer_had_error\": {{analysis3.error ? true : false}},\n      \"episodic_thematic_analyzer_had_error\": {{analysis4.error ? true : false}},\n      \"violence_type_analyzer_had_error\": {{analysis5.error ? true : false}}\n  }},\n      \"speculative_reframing_analyzer_had_error\": {{analysis2.error ? true : false}},\n      \"euphemism_analyzer_had_error\": {{analysis3.error ? true : false}},\n      \"episodic_thematic_analyzer_had_error\": {{analysis4.error ? true : false}},\n      \"violence_type_analyzer_had_error\": {{analysis5.error ? true : false}}\n  }},\n      \"speculative_reframing_analyzer_had_error\": {{analysis2.error ? true : false}},\n      \"euphemism_analyzer_had_error\": {{analysis3.error ? true : false}},\n      \"episodic_thematic_analyzer_had_error\": {{analysis4.error ? true : false}},\n      \"violence_type_analyzer_had_error\": {{analysis5.error ? true : false}}\n  }},\n      \"speculative_reframing_analyzer_had_error\": {{analysis2.error ? true : false}},\n      \"euphemism_analyzer_had_error\": {{analysis3.error ? true : false}},\n      \"episodic_thematic_analyzer_had_error\": {{analysis4.error ? true : false}},\n      \"violence_type_analyzer_had_error\": {{analysis5.error ? true : false}}\n  }},\n      \"speculative_reframing_had_error\": {{analysis2.error ? true : false}},\n      \"euphemism_analysis_had_error\": {{analysis3.error ? true : false}},\n      \"episodic_thematic_analysis_had_error\": {{analysis4.error ? true : false}},\n      \"violence_type_analysis_had_error\": {{analysis5.error ? true : false}}\n  }\n}\nExample:\nInput Headline: \"[LEADER_X] announces decisive action against protest.\"\nCognitive Frame Analysis might indicate \"Control/Order\" frame.\nFlipped Headline might be: \"Community members express concerns as [LEADER_X] escalates measures against public assembly.\"\n\nOutput:\n{\n  \"input_headline_processed\": \"[LEADER_X] announces decisive action against protest.\",\n  \"flipped_headline\": \"Community members express concerns as [LEADER_X] escalates measures against public assembly.\",\n  \"reasoning_for_flip\": \"Flipped from a 'Control/Order' frame implied by 'decisive action' to a 'Concern/Rights' frame by focusing on community perspective and 'escalates measures'.\",\n  \"analysis_summary_used\": { \"cognitive_frames_had_error\": false, \"speculative_reframing_had_error\": false, \"euphemism_analysis_had_error\": false, \"episodic_thematic_analysis_had_error\": false, \"violence_type_analysis_had_error\": false }\n}",
        "userInputTemplate": "Synthesize a flipped headline for: \"{{headlineToSynthesize}}\" using the provided analyses."
      }
    },
    {
      "id": "main_headline_reverter",
      "displayName": "3. Revert Main Flipped Headline",
      "type": "local_function",
      "functionName": "revertProperNouns",
      "stateInputArgs": {
        "text_with_placeholders": "main_flipped_headline_with_placeholders",
        "properNoun_map": "properNoun_map"
      }
    },
    {
      "id": "data_collector_for_saver",
      "displayName": "Collect Data for Saver",
      "type": "local_function",
      "functionName": "collectAndVerifyDataForSaver",
      "stateInputArgs": {
        "input_headline": "input_headline",
        "main_flipped_headline_from_state": "flipped_headline",
        "cognitive_frames_reverted_headline": "cognitive_frames_reverted_headline",
        "speculative_reframing_reverted_headline": "speculative_reframing_reverted_headline",
        "euphemism_reverted_headline": "euphemism_reverted_headline",
        "episodic_thematic_reverted_headline": "episodic_thematic_reverted_headline",
        "violence_type_reverted_headline": "violence_type_reverted_headline"
      },
      "stateOutputKey": "data_package_for_saver"
    },
    {
      "id": "saver",
      "displayName": "4. Save All to DB",
      "type": "local_function",
      "functionName": "saveAllToDynamoDB",
      "stateInputArgs": {
        "packaged_data": "data_package_for_saver"
      },
      "stateOutputKey": "db_save_status"
    },
    {
      "id": "cognitive_frames_reverter",
      "displayName": "Revert cognitive frames Suggestion",
      "type": "local_function",
      "functionName": "revertGenericAnalyzerHeadline",
      "stateInputArgs": {
        "analyzer_result_object": "cognitive_frames_analysis_result",
        "properNoun_map": "properNoun_map"
      },
      "stateOutputKey": "cognitive_frames_reverted_headline"
    },
    {
      "id": "speculative_reframing_reverter",
      "displayName": "Revert speculative reframing Suggestion",
      "type": "local_function",
      "functionName": "revertGenericAnalyzerHeadline",
      "stateInputArgs": {
        "analyzer_result_object": "speculative_reframing_result",
        "properNoun_map": "properNoun_map"
      },
      "stateOutputKey": "speculative_reframing_reverted_headline"
    },
    {
      "id": "euphemism_reverter",
      "displayName": "Revert euphemism Suggestion",
      "type": "local_function",
      "functionName": "revertGenericAnalyzerHeadline",
      "stateInputArgs": {
        "analyzer_result_object": "euphemism_analysis_result",
        "properNoun_map": "properNoun_map"
      },
      "stateOutputKey": "euphemism_reverted_headline"
    },
    {
      "id": "episodic_thematic_reverter",
      "displayName": "Revert episodic thematic Suggestion",
      "type": "local_function",
      "functionName": "revertGenericAnalyzerHeadline",
      "stateInputArgs": {
        "analyzer_result_object": "episodic_thematic_analysis_result",
        "properNoun_map": "properNoun_map"
      },
      "stateOutputKey": "episodic_thematic_reverted_headline"
    },
    {
      "id": "violence_type_reverter",
      "displayName": "Revert violence type Suggestion",
      "type": "local_function",
      "functionName": "revertGenericAnalyzerHeadline",
      "stateInputArgs": {
        "analyzer_result_object": "violence_type_analysis_result",
        "properNoun_map": "properNoun_map"
      },
      "stateOutputKey": "violence_type_reverted_headline"
    }
  ],
  "graphEdges": [
    {
      "source": "properNoun_replacer1",
      "target": "parallel_analyzers_coordinator"
    },
    {
      "source": "parallel_analyzers_coordinator",
      "target": "synthesizer"
    },
    {
      "source": "synthesizer",
      "target": "main_headline_reverter"
    },
    {
      "source": "main_headline_reverter",
      "target": "data_collector_for_saver"
    },
    {
      "source": "data_collector_for_saver",
      "target": "saver"
    },
    {
      "source": "saver",
      "target": "END"
    },
    {
      "source": "parallel_analyzers_coordinator",
      "target": "cognitive_frames_reverter"
    },
    {
      "source": "cognitive_frames_reverter",
      "target": "data_collector_for_saver"
    },
    {
      "source": "parallel_analyzers_coordinator",
      "target": "speculative_reframing_reverter"
    },
    {
      "source": "speculative_reframing_reverter",
      "target": "data_collector_for_saver"
    },
    {
      "source": "parallel_analyzers_coordinator",
      "target": "euphemism_reverter"
    },
    {
      "source": "euphemism_reverter",
      "target": "data_collector_for_saver"
    },
    {
      "source": "parallel_analyzers_coordinator",
      "target": "episodic_thematic_reverter"
    },
    {
      "source": "episodic_thematic_reverter",
      "target": "data_collector_for_saver"
    },
    {
      "source": "parallel_analyzers_coordinator",
      "target": "violence_type_reverter"
    },
    {
      "source": "violence_type_reverter",
      "target": "data_collector_for_saver"
    }
  ]
}